<?php 
$data = array();

$data[0] = array('安徽','北京','福建','甘肃','广东','广西','贵州','海南','河北','河南','黑龙江','湖北','湖南','吉林','江苏','江西','辽宁','内蒙古','宁夏','青海','山东','山西','陕西','上海','四川','天津','西藏','新疆','云南','浙江','重庆');
// 安徽
$data[0][0] = array('安庆','蚌埠','巢湖','池州','滁州','阜阳','合肥','淮北','淮南','黄山','六安','马鞍山','宿州','铜陵','芜湖','宣城','毫州');
$data[0][0][0] = array('安庆市','怀宁县','潜山县','宿松县','太湖县','桐城市','望江县','岳西县','枞阳县');
$data[0][0][1] = array('蚌埠市','固镇县','怀远县','五河县');
$data[0][0][2] = array('巢湖市','含山县','和县','庐江县','无为县');
$data[0][0][3] = array('池州市','东至县','青阳县','石台县');
$data[0][0][4] = array('滁州市','定远县','凤阳县','来安县','明光市','全椒县','天长市');
$data[0][0][5] = array('阜南县','阜阳市','界首市','临泉县','太和县','颖上县');
$data[0][0][6] = array('长丰县','肥东县','肥西县');
$data[0][0][7] = array('淮北市','濉溪县');
$data[0][0][8] = array('凤台县','淮南市');
$data[0][0][9] = array('黄山市','祁门县','休宁县','歙县','黟县');
$data[0][0][10] = array('霍邱县','霍山县','金寨县','六安市','寿县','舒城县');
$data[0][0][11] = array('当涂县','马鞍山市');
$data[0][0][12] = array('灵璧县','宿州市','萧县','泗县','砀山县');
$data[0][0][13] = array('铜陵市','铜陵县');
$data[0][0][14] = array('繁昌县','南陵县','芜湖市','芜湖县');
$data[0][0][15] = array('广德县','绩溪县','郎溪县','宁国市','宣城市','泾县','旌德县');
$data[0][0][16] = array('利辛县','蒙城县','涡阳县','亳州市');
// 北京
$data[0][1] = array('北京市');
$data[0][1][0] = array('北京市','密云县','延庆县');
// 福建
$data[0][2] = array('福州','龙岩','南平','宁德','莆田','泉州','三明','厦门','漳州');
$data[0][2][0] = array('长乐市','福清市','福州市','连江县','罗源县','闽侯县','闽清县','平潭县','永泰县');
$data[0][2][1] = array('长汀县','连城县','龙岩市','上杭县','武平县','永定县','漳平市');
$data[0][2][2] = array('光泽县','建阳市','建瓯市','南平市','浦城县','邵武市','顺昌县','松溪县','武夷山市','政和县');
$data[0][2][3] = array('福安市','福鼎市','古田县','宁德市','屏南县','寿宁县','霞浦县','周宁县','柘荣县');
$data[0][2][4] = array('莆田市','仙游县');
$data[0][2][5] = array('安溪县','德化县','惠安县','金门县','晋江市','南安市','泉州市','石狮市','永春县');
$data[0][2][6] = array('大田县','建宁县','将乐县','明溪县','宁化县','清流县','三明市','沙县','泰宁县','永安市','尤溪县');
$data[0][2][7] = array('厦门市');
$data[0][2][8] = array('长泰县','东山县','华安县','龙海市','南靖县','平和县','云霄县','漳浦县','漳州市','诏安县');
// 甘肃
$data[0][3] = array('白银','定西','甘南藏族自治州','嘉峪关','金昌','酒泉','兰州','临夏回族自治州','陇南','平凉','庆阳','天水','武威','张掖');
$data[0][3][0] = array('白银市','会宁县','景泰县','靖远县');
$data[0][3][1] = array('定西县','临洮县','陇西县','通渭县','渭源县','漳县','岷县');
$data[0][3][2] = array('迭部县','合作市','临潭县','碌曲县','玛曲县','夏河县','舟曲县','卓尼县');
$data[0][3][3] = array('嘉峪关市');
$data[0][3][4] = array('金昌市','永昌县');
$data[0][3][5] = array('阿克塞哈萨克族自治县','安西县','敦煌市','金塔县','酒泉市','肃北蒙古族自治县','玉门市');
$data[0][3][6] = array('皋兰县','兰州市','永登县','榆中县');
$data[0][3][7] = array('东乡族自治县','广河县','和政县','积石山保安族东乡族撒拉族自治县','康乐县','临夏市','临夏县','永靖县');
$data[0][3][8] = array('成县','徽县','康县','礼县','两当县','文县','武都县','西和县','宕昌县');
$data[0][3][9] = array('崇信县','华亭县','静宁县','灵台县','平凉市','庄浪县','泾川县');
$data[0][3][10] = array('合水县','华池县','环县','宁县','庆城县','庆阳市','镇原县','正宁县');
$data[0][3][11] = array('甘谷县','秦安县','清水县','天水市','武山县','张家川回族自治县');
$data[0][3][12] = array('古浪县','民勤县','天祝藏族自治县','武威市');
$data[0][3][13] = array('高台县','临泽县','民乐县','山丹县','肃南裕固族自治县','张掖市');
// 广东
$data[0][4] = array('潮州','东莞','佛山','广州','河源','惠州','江门','揭阳','茂名','梅州','清远','汕头','汕尾','韶关','深圳','阳江','云浮','湛江','肇庆','中山','珠海');
$data[0][4][0] = array('潮安县','潮州市','饶平县');
$data[0][4][1] = array('东莞市');
$data[0][4][2] = array('佛山市');
$data[0][4][3] = array('从化市','广州市','增城市');
$data[0][4][4] = array('东源县','和平县','河源市','连平县','龙川县','紫金县');
$data[0][4][5] = array('博罗县','惠东县','惠阳市','惠州市','龙门县');
$data[0][4][6] = array('恩平市','鹤山市','江门市','开平市','台山市');
$data[0][4][7] = array('惠来县','揭东县','揭西县','揭阳市','普宁市');
$data[0][4][8] = array('电白县','高州市','化州市','茂名市','信宜市');
$data[0][4][9] = array('大埔县','丰顺县','蕉岭县','梅县','梅州市','平远县','五华县','兴宁市');
$data[0][4][10] = array('佛冈县','连南瑶族自治县','连山壮族瑶族自治县','连州市','清新县','清远市','阳山县','英德市');
$data[0][4][11] = array('潮阳市','澄海市','南澳县','汕头市');
$data[0][4][12] = array('海丰县','陆丰市','陆河县','汕尾市');
$data[0][4][13] = array('乐昌市','南雄市','曲江县','仁化县','乳源瑶族自治县','韶关市','始兴县','翁源县','新丰县');
$data[0][4][14] = array('深圳市');
$data[0][4][15] = array('阳春市','阳东县','阳江市','阳西县');
$data[0][4][16] = array('罗定市','新兴县','郁南县','云安县','云浮市');
$data[0][4][17] = array('雷州市','廉江市','遂溪县','吴川市','徐闻县','湛江市');
$data[0][4][18] = array('德庆县','封开县','高要市','广宁县','怀集县','四会市','肇庆市');
$data[0][4][19] = array('中山市');
$data[0][4][20] = array('珠海市');
// 广西
$data[0][5] = array('百色','北海','崇左','防城港','桂林','贵港','河池','贺州','来宾','柳州','南宁','钦州','梧州','玉林');
$data[0][5][0] = array('百色市','德保县','靖西县','乐业县','凌云县','隆林各族自治县','那坡县','平果县','田东县','田林县','田阳县','西林县');
$data[0][5][1] = array('北海市','合浦县');
$data[0][5][2] = array('崇左市','大新县','扶绥县','龙州县','宁明县','凭祥市','天等县');
$data[0][5][3] = array('东兴市','防城港市','上思县');
$data[0][5][5] = array('恭城瑶族自治县','灌阳县','桂林市','荔浦县','临桂县','灵川县','龙胜各族自治县','平乐县','全州县','兴安县','阳朔县','永福县','资源县');
$data[0][5][5] = array('桂平市','贵港市','平南县');
$data[0][5][6] = array('巴马瑶族自治县','大化瑶族自治县','东兰县','都安瑶族自治县','凤山县','河池市','环江毛南族自治县','罗城仡佬族自治县','南丹县','天峨县','宜州市');
$data[0][5][7] = array('富川瑶族自治县','贺州市','昭平县','钟山县');
$data[0][5][8] = array('合山市','金秀瑶族自治县','来宾市','武宣县','象州县','忻城县');
$data[0][5][9] = array('柳城县','柳江县','柳州市','鹿寨县','融安县','融水苗族自治县','三江侗族自治县');
$data[0][5][10] = array('宾阳县','横县','隆安县','马山县','南宁市','上林县','武鸣县','邕宁县');
$data[0][5][11] = array('灵山县','浦北县','钦州市');
$data[0][5][12] = array('苍梧县','蒙山县','藤县','梧州市','岑溪市');
$data[0][5][13] = array('北流市','博白县','陆川县','容县','兴业县','玉林市');
// 贵州
$data[0][6] = array('安顺','毕节','贵阳','六盘水','黔东南苗族侗族自治州','黔南布依族苗族自治州','黔西南布依族苗族自治州','铜仁','遵义');
$data[0][6][0] = array('安顺市','关岭布依族苗族自治县','平坝县','普定县','镇宁布依族苗族自治县','紫云苗族布依族自治县');
$data[0][6][1] = array('毕节市','大方县','赫章县','金沙县','纳雍县','黔西县','威宁彝族回族苗族自治县','织金县');
$data[0][6][2] = array('贵阳市','开阳县','清镇市','息烽县','修文县');
$data[0][6][3] = array('六盘水市','六枝特区','盘县','水城县');
$data[0][6][4] = array('从江县','丹寨县','黄平县','剑河县','锦屏县','凯里市','雷山县','黎平县','麻江县','三穗县','施秉县','台江县','天柱县','镇远县','岑巩县','榕江县');
$data[0][6][5] = array('长顺县','都匀市','独山县','福泉市','贵定县','惠水县','荔波县','龙里县','罗甸县','平塘县','三都水族自治县','瓮安县');
$data[0][6][6] = array('安龙县','册亨县','普安县','晴隆县','望谟县','兴仁县','兴义市','贞丰县');
$data[0][6][7] = array('德江县','江口县','石阡县','思南县','松桃苗族自治县','铜仁市','万山特区','沿河土家族自治县','印江土家族苗族自治县','玉屏侗族自治县');
$data[0][6][8] = array('赤水市','道真仡佬族苗族自治县','凤冈县','仁怀市','绥阳县','桐梓县','务川仡佬族苗族自治县','习水县','余庆县','正安县','遵义市','遵义县','湄潭县');
// 海南
$data[0][7] = array('白沙黎族自治县','保亭黎族苗族自治县','昌江黎族自治县','澄迈县','定安县','东方','海口','乐东黎族自治县','临高县',' 陵水黎族自治县','琼海','琼中黎族苗族自治县','三亚','屯昌县','万宁','文昌','五指山','儋州');
$data[0][7][0] = array('白沙黎族自治县');
$data[0][7][1] = array('保亭黎族苗族自治县');
$data[0][7][2] = array('昌江黎族自治县');
$data[0][7][3] = array('澄迈县');
$data[0][7][4] = array('定安县');
$data[0][7][5] = array('东方市');
$data[0][7][6] = array('海口市');
$data[0][7][7] = array('乐东黎族自治县');
$data[0][7][8] = array('临高县');
$data[0][7][9] = array('陵水黎族自治县');
$data[0][7][10] = array('琼海市');
$data[0][7][11] = array('琼中黎族苗族自治县');
$data[0][7][12] = array('三亚市');
$data[0][7][13] = array('屯昌县');
$data[0][7][14] = array('万宁市');
$data[0][7][15] = array('文昌市');
$data[0][7][16] = array('五指山市');
$data[0][7][17] = array('儋州市');
// 河北
$data[0][8] = array('保定','沧州','承德','邯郸','衡水','廊坊','秦皇岛','石家庄','唐山','邢台','张家口');
$data[0][8][0] = array('安国市','安新县','保定市','博野县','定兴县','定州市','阜平县','高碑店市','高阳县','满城县','清苑县','曲阳 县','容城县','顺平县','唐县','望都县','雄县','徐水县','易县','涞水县','涞源县','涿州市','蠡县');
$data[0][8][1] = array('泊头市','沧县','沧州市','东光县','海兴县','河间市','黄骅市','孟村回族自治县','南皮县','青县','任丘市','肃宁县','吴桥县','献县','盐山县');
$data[0][8][2] = array('承德市','承德县','丰宁满族自治县','宽城满族自治县','隆化县','滦平县','平泉县','围场满族蒙古族自治县','兴隆县');
$data[0][8][3] = array('成安县','磁县','大名县','肥乡县','馆陶县','广平县','邯郸市','邯郸县','鸡泽县','临漳县','邱县','曲周县','涉县','魏县','武安市','永年县');
$data[0][8][4] = array('安平县','阜城县','故城县','衡水市','冀州市','景县','饶阳县','深州市','武强县','武邑县','枣强县');
$data[0][8][5] = array('霸州市','大厂回族自治县','大城县','固安县','廊坊市','三河市','文安县','香河县','永清县');
$data[0][8][6] = array('昌黎县','抚宁县','卢龙县','秦皇岛市','青龙满族自治县');
$data[0][8][7] = array('高邑县','晋州市','井陉县','灵寿县','鹿泉市','平山县','深泽县','石家庄市','无极县','辛集市','新乐市','行唐县','元氏县','赞皇县','赵县','正定县','藁城市','栾城县');
$data[0][8][8] = array('乐亭县','滦南县','滦县','迁安市','迁西县','唐海县','唐山市','玉田县','遵化市');
$data[0][8][9] = array('柏乡县','广宗县','巨鹿县','临城县','临西县','隆尧县','南宫市','南和县','内丘县','宁晋县','平乡县','清河县','任县','沙河市','威县','新河县','邢台市','邢台县');
$data[0][8][10] = array('赤城县','崇礼县','沽源县','怀安县','怀来县','康保县','尚义县','万全县','蔚县','宣化县','阳原县','张北县','张家口市','涿鹿县');
// 河南
$data[0][9] = array('安阳','鹤壁','济源','焦作','开封','洛阳','南阳','平顶山','三门峡','商丘','新乡','信阳','许昌','郑州','周口','驻马店','漯河','濮阳');
$data[0][9][0] = array('安阳市','安阳县','滑县','林州市','内黄县','汤阴县');
$data[0][9][1] = array('','鹤壁市','浚县','淇县');
$data[0][9][2] = array('济源市');
$data[0][9][3] = array('博爱县','焦作市','孟州市','沁阳市','温县','武陟县','修武县');
$data[0][9][4] = array('开封市','开封县','兰考县','通许县','尉氏县','杞县');
$data[0][9][5] = array('洛宁县','洛阳市','孟津县','汝阳县','新安县','伊川县','宜阳县','偃师市','嵩县','栾川县');
$data[0][9][6] = array('邓州市','方城县','南阳市','南召县','内乡县','社旗县','唐河县','桐柏县','西峡县','新野县','镇平县','淅川县');
$data[0][9][7] = array('宝丰县','鲁山县','平顶山市','汝州市','舞钢市','叶县','郏县');
$data[0][9][8] = array('灵宝市','卢氏县','三门峡市','陕县','义马市','渑池县');
$data[0][9][9] = array('民权县','宁陵县','商丘市','夏邑县','永城市','虞城县','柘城县','睢县');
$data[0][9][10] = array('长垣县','封丘县','辉县市','获嘉县','卫辉市','新乡市','新乡县','延津县','原阳县');
$data[0][9][11] = array('固始县','光山县','淮滨县','罗山县','商城县','息县','新县','信阳市','潢川县');
$data[0][9][12] = array('长葛市','襄城县','许昌市','许昌县','禹州市','鄢陵县');
$data[0][9][13] = array('登封市','巩义市','新密市','新郑市','郑州市','中牟县','荥阳市');
$data[0][9][14] = array('郸城县','扶沟县','淮阳县','鹿邑县','商水县','沈丘县','太康县','西华县','项城市','周口市');
$data[0][9][15] = array('泌阳县','平舆县','确山县','汝南县','上蔡县','遂平县','西平县','新蔡县','正阳县','驻马店市');
$data[0][9][16] = array('临颍县','舞阳县','郾城县','漯河市');
$data[0][9][17] = array('范县','南乐县','清丰县','台前县','濮阳市','濮阳县');
// 黑龙江
$data[0][10] = array('大庆','大兴安岭','哈尔滨','鹤岗','黑河','鸡西','佳木斯','牡丹江','七台河','齐齐哈尔','双鸭山','绥化','伊春');
$data[0][10][0] = array('大庆市','杜尔伯特蒙古族自治县','林甸县','肇源县','肇州县');
$data[0][10][1] = array('呼玛县','漠河县','塔河县');
$data[0][10][2] = array('阿城市','巴彦县','宾县','方正县','哈尔滨市','呼兰县','木兰县','尚志市','双城市','通河县','五常市','延寿县','依兰县');
$data[0][10][3] = array('鹤岗市','萝北县','绥滨县');
$data[0][10][4] = array('北安市','黑河市','嫩江县','孙吴县','五大连池市','逊克县');
$data[0][10][5] = array('虎林市','鸡东县','鸡西市','密山市');
$data[0][10][6] = array('抚远县','富锦市','佳木斯市','汤原县','同江市','桦川县','桦南县');
$data[0][10][7] = array('东宁县','海林市','林口县','牡丹江市','穆棱市','宁安市','绥芬河市');
$data[0][10][8] = array('勃利县','七台河市');
$data[0][10][9] = array('拜泉县','富裕县','甘南县','克东县','克山县','龙江县','齐齐哈尔市','泰来县','依安县','讷河市');
$data[0][10][10] = array('宝清县','集贤县','饶河县','双鸭山市','友谊县');
$data[0][10][11] = array('安达市','海伦市','兰西县','明水县','青冈县','庆安县','绥化市','绥棱县','望奎县','肇东市');
$data[0][10][12] = array('嘉荫县','铁力市','伊春市');
// 湖北
$data[0][11] = array('鄂州','恩施土家族苗族自治州','黄冈','黄石','荆门','荆州','潜江','神农架林区','十堰','随州','天门','武汉','仙桃','咸宁','襄樊','孝感','宜昌');
$data[0][11][0] = array('鄂州市');
$data[0][11][1] = array('巴东县','恩施市','鹤峰县','建始县','来凤县','利川市','咸丰县','宣恩县');
$data[0][11][2] = array('红安县','黄冈市','黄梅县','罗田县','麻城市','团风县','武穴市','英山县','蕲春县','浠水县');
$data[0][11][3] = array('大冶市','黄石市','阳新县');
$data[0][11][4] = array('荆门市','京山县','沙洋县','钟祥市');
$data[0][11][5] = array('公安县','洪湖市','监利县','江陵县','荆州市','石首市','松滋市');
$data[0][11][6] = array('潜江市');
$data[0][11][7] = array('神农架林区');
$data[0][11][8] = array('丹江口市','房县','十堰市','郧西县','郧县','竹山县','竹溪县');
$data[0][11][9] = array('广水市','随州市');
$data[0][11][10] = array('天门市');
$data[0][11][11] = array('武汉市');
$data[0][11][12] = array('仙桃市');
$data[0][11][13] = array('赤壁市','崇阳县','嘉鱼县','通城县','通山县','咸宁市');
$data[0][11][14] = array('保康县','谷城县','老河口市','南漳县','襄樊市','宜城市','枣阳市');
$data[0][11][15] = array('安陆市','大悟县','汉川市','孝昌县','孝感市','应城市','云梦县');
$data[0][11][16] = array('长阳土家族自治县','当阳市','五峰土家族自治县','兴山县','宜昌市','宜都市','远安县','枝江市','秭归县');
// 湖南
$data[0][12] = array('常德','长沙','郴州','衡阳','怀化','娄底','邵阳','湘潭','湘西土家族苗族自治州','益阳','永州','岳阳','张家界','株洲');
$data[0][12][0] = array('安乡县','常德市','汉寿县','津市市','临澧县','石门县','桃源县','澧县');
$data[0][12][1] = array('长沙市','长沙县','宁乡县','望城县','浏阳市');
$data[0][12][2] = array('安仁县','郴州市','桂东县','桂阳县','嘉禾县','临武县','汝城县','宜章县','永兴县','资兴市');
$data[0][12][3] = array('常宁市','衡东县','衡南县','衡山县','衡阳市','衡阳县','祁东县','耒阳市');
$data[0][12][4] = array('辰溪县','洪江市','怀化市','会同县','靖州苗族侗族自治县','麻阳苗族自治县','通道侗族自治县','新晃侗族自治县','中方县','芷江侗族自治县','沅陵县','溆浦县');
$data[0][12][5] = array('冷水江市','涟源市','娄底市','双峰县','新化县');
$data[0][12][6] = array('城步苗族自治县','洞口县','隆回县','邵东县','邵阳市','邵阳县','绥宁县','武冈市','新宁县','新邵县');
$data[0][12][7] = array('韶山市','湘潭市','湘潭县','湘乡市');
$data[0][12][8] = array('保靖县','凤凰县','古丈县','花垣县','吉首市','龙山县','永顺县','泸溪县');
$data[0][12][9] = array('安化县','南县','桃江县','益阳市','沅江市');
$data[0][12][10] = array('道县','东安县','江华瑶族自治县','江永县','蓝山县','宁远县','祁阳县','双牌县','新田县','永州市');
$data[0][12][11] = array('华容县','临湘市','平江县','湘阴县','岳阳市','岳阳县','汨罗市');
$data[0][12][12] = array('慈利县','桑植县','张家界市');
$data[0][12][13] = array('茶陵县','炎陵县','株洲市','株洲县','攸县','醴陵市');
// 吉林
$data[0][13] = array('白城','白山','长春','吉林','辽源','四平','松原','通化','延边朝鲜族自治州');
$data[0][13][0] = array('白城市','大安市','通榆县','镇赉县','洮南市');
$data[0][13][1] = array('白山市','长白朝鲜族自治县','抚松县','江源县','靖宇县','临江市');
$data[0][13][2] = array('长春市','德惠市','九台市','农安县','榆树市');
$data[0][13][3] = array('吉林市','磐石市','舒兰市','永吉县','桦甸市','蛟河市');
$data[0][13][4] = array('东丰县','东辽县','辽源市');
$data[0][13][5] = array('公主岭市','梨树县','双辽市','四平市','伊通满族自治县');
$data[0][13][6] = array('长岭县','扶余县','乾安县','前郭尔罗斯蒙古族自治县','松原市');
$data[0][13][7] = array('辉南县','集安市','柳河县','梅河口市','通化市','通化县');
$data[0][13][8] = array('安图县','敦化市','和龙市','龙井市','图们市','汪清县','延吉市','珲春市');
// 江苏
// 江西
// 辽宁
// 内蒙古
// 宁夏
// 青海
// 山东
// 山西
// 陕西
// 上海
// 四川
// 天津
// 西藏
// 新疆
// 云南
// 浙江
// 重庆
?>